xmlsamples/PI_MTCN/CN-SMV-AIS.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <S:Body>
      <ns2:send-money-validation-request xmlns:ns2="http://www.westernunion.com/schema/xrsi">
         <device>
            <id>GJZFQZ02</id>
            <type>RETAIL</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>PSBC</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>JINGHUA</first_name>
               <middle_name>TINA</middle_name>
               <last_name>ZHANG</last_name>
            </name>
            <address>
               <addr_line1>1 API_WS_ERR_01 MLA.</addr_line1>
               <city>MNS</city>
               <state>MNS</state>
               <postal_code>123456</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>CN</country_code>
                     <currency_code>USD</currency_code>
                  </iso_code>
               </country_code>
               <state_zip>123456</state_zip>
               <street>CHINA Street 1</street>
            </address>
            <compliance_details>
               <template_id>CHN_01_S</template_id>
               <id_details>
                  <id_type>A</id_type>
                  <id_country_of_issue>CHINA</id_country_of_issue>
                  <id_number>350802198710301522</id_number>
               </id_details>
               <id_expiration_date>31122040</id_expiration_date>
               <date_of_birth>01011973</date_of_birth>
               <occupation>CONSULTANT</occupation>
               <Country_of_Birth>CHINA</Country_of_Birth>
               <nationality>CHINA</nationality>
               <Gender>F</Gender>
               <Does_the_ID_have_an_expiration_date>Y</Does_the_ID_have_an_expiration_date>
               <ack_flag>X</ack_flag>
               <does_the_ID_have_an_issue_date>Y</does_the_ID_have_an_issue_date>
               <employment_position_level/>
            </compliance_details>
            <contact_phone>01072621959</contact_phone>
            <fraud_warning_consent>Y</fraud_warning_consent>
            <bank_details>
               <name>PSBC</name>
               <account_number>27291022843507</account_number>
            </bank_details>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>YONG</first_name>
               <middle_name>ZHAO</middle_name>
               <last_name>FENG</last_name>
            </name>
            <address>
               <addr_line1>No 1 / Blk 1,Philippines</addr_line1>
               <country_code>
                  <iso_code>
                     <country_code>KR</country_code>
                     <currency_code>USD</currency_code>
                  </iso_code>
               </country_code>
            </address>
            <contact_phone>7514562017</contact_phone>
         </receiver>
         <payment_details>
            <recording_country_currency>
               <iso_code>
                  <country_code>CN</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>KR</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>CN</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </originating_country_currency>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <duplicate_detection_flag>D</duplicate_detection_flag>
            <original_destination_country_currency>
               <iso_code>
                  <country_code>KR</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </original_destination_country_currency>
         </payment_details>
         <financials>
            <originators_principal_amount>2500</originators_principal_amount>
         </financials>
         <delivery_services>
            <code>000</code>
            <message>
               <message_details context="ASIA BRIDGE 3"/>
            </message>
         </delivery_services>
         <foreign_remote_system>
            <identifier>WGHHCNE050T</identifier>
            <reference_no>2387493732928737</reference_no>
            <counter_id>CNE05AWT001A</counter_id>
         </foreign_remote_system>
      </ns2:send-money-validation-request>
   </S:Body>
</S:Envelope>